export const slides2 = [
  {
    num: 1,
    text: `تأسس النادي الليبي لليخوت عام 2015 في طرابلس، ليكون صرحاً
                    بحرياً غير ربحي يهدف إلى نشر وتطوير الرياضات البحرية المتنوعة.
                    بفضل رؤية مؤسسيه من المدربين والخبراء، يقدّم النادي بيئة ملهمة
                    لتعلّم وممارسة رياضات الشراع، التجديف، والسباحة ضمن معايير
                    عالمية، بإشراف الهيئة العامة للشباب والرياضة وعضوية في الاتحاد
                    الليبي للشراع والرياضات البحرية، واتحاد السباحة، واتحاد
                    التجديف.`,
  },
  {
    num: 2,
    text: `يستضيف النادي برامج تدريبية موسمية متخصصة للصغار والشباب وحتى الكبار، تشمل القوارب الشراعية بأنواعها مثل Optimist وLaser، والألواح الشراعية، بالإضافة إلى تقديم دورات تعليم السباحة. كما يشكّل النادي فرقاً رياضية تُمثله محلياً ودولياً، ويدعم رياضييه ليشاركوا في بطولات محلية وأخرى دولية في الجزائر، تونس، وتركيا.`,
  },
  {
    num: 3,
    text: `تأسس النادي الليبي لليخوت عام 2015 في طرابلس، ليكون صرحاً
                    بحرياً غير ربحي يهدف إلى نشر وتطوير الرياضات البحرية المتنوعة.
                    بفضل رؤية مؤسسيه من المدربين والخبراء، يقدّم النادي بيئة ملهمة
                    لتعلّم وممارسة رياضات الشراع، التجديف، والسباحة ضمن معايير
                    عالمية، بإشراف الهيئة العامة للشباب والرياضة وعضوية في الاتحاد
                    الليبي للشراع والرياضات البحرية، واتحاد السباحة، واتحاد
                    التجديف.`,
  },
]
export type Evnt = {
  year: number
  title: string
  description: string
  images: string[]
}
