import type { Program } from '@/types/program'

export const programs: Program[] = [
  {
    id: 1,
    title: 'إدارة السباقات والتحكيم',
    description: 'خبرات متميزة في مجال التحكيم وإدارة السباقات الشراعية',
    icon: '🏆',
    img: 'https://lyc.ly/assets/imeges/golden2017kids7.jpg',
    color: '#027e9fbd',
    backgroundImage: 'https://lyc.ly/assets/imeges/image10.jpg',
    fullDescription:
      'يضم النادي الليبي لليخوت مجموعة من الخبرات في مجال التحكيم و إدارة السباقات خاصة في رياضة الشراع، و تعتبر إدارة السباقات والتحكيم من البرامج التي يشارك فيها النادي الليبي لليخوت من خلال تحكيم و إدارة السباقات المقامة في ليبيا سواء على مستوى الأندية أو الاتحادات الفرعية و حتى الاتحاد العام ، و أحياناً ما تشارك هذه الخبرات في إدارة السباقات في الدول المجاورة مثل تونس و الجزائر.',
  },
  {
    id: 2,
    title: 'جائزة الريادة',
    description: 'تكريم الشخصيات المؤثرة في تطوير الرياضة',
    icon: '🏅',
    img: 'https://lyc.ly/assets/imeges/IMG_6183.jpg',
    color: '#ef4949bd',
    backgroundImage: 'https://lyc.ly/assets/imeges/golden2017kids.jpg',
    fullDescription:
      'تعهّد النادي الليبي لليخوت على نفسه تكريم الشخصيات التي ساهمت أو لازالت تساهم في نشر و تطوير الرياضة و من هذا العهد انبثقت فكرة جائزة الريادة والتي يمنحها النادي الليبي لليخوت في كل سنة لشخصيتين الأولى قدمت للرياضة على مستوى النادي و الثانية شخصية قدمت للرياضة على مستوى الوطن.',
  },
  {
    id: 3,
    title: 'البطولة السنوية',
    description: 'تتويج لمجهودات النادي وختام موسم التدريب',
    icon: '🏆',
    img: '',
    color: '#FFC400',
    backgroundImage: 'https://lyc.ly/assets/imeges/golden2017kids3.jpg',
    fullDescription:
      'البطولة السنوية هي تتويج لمجهودات النادي وختام موسم التدريب والمشاركات التي يخوضها رياضي الفريق الاول للنادي وايضا هي فرصة للرياضين الذين لم تتح لهم الفرصة في خوض غمار البطولات ولإبراز قدراتهم وكانت هناك ثلاث بطولات سنوية مفتوحة للنادي على مدار 3 سنوات شاركت فيها العديد من الأندية المحلية من مختلف المدن الليبية.',
  },
  {
    id: 4,
    title: 'الدورات التدريبية',
    description: 'برامج تدريبية متنوعة على مدار السنة',
    icon: '⛵',
    img: 'https://lyc.ly/assets/imeges/cours1.jpg',
    color: '',
    backgroundImage: 'https://lyc.ly/assets/imeges/cours2.jpg',
    fullDescription: `يقيم النادي مجموعة من الدورات التدريبية خلال السنة تغطي مجموعة رياضات ، حيث تقام دورات التعليم خلال موسم الصيف وفقاً لبرنامج تدريبي معد من قبل الطاقم الفني ، هذا البرنامج يقدم المنهج المعتمد في النادي والذي هو مقتبس من منهج الاتحاد الدولي للشراع و جمعيات الأصناف الدولية المختلفة.
     هاذا المنهج ينقسم الى مستويات يتدرج الرياضي خلالها من تعلم  الرياضة الى تطوير المهرات الى أسس التسابق وينتهي بالمتسابق و التنافس في البطولات المختلفة . يغطي موسم الصيف المسويين الأول والثاني في منهجنا ثم يختار الطاقم الفني عدد من الرياضيين للأنضمام لفريق النادي الذين يستمرون في تدريباتهم خلال فصل الشتاء , من المؤسف أن عدد الرياضيين الذيه يتم أختيارهم قليل لعدم توفر العدد الكافي من المعدات . أما بالنسبة للسباحة فان النادي يقيم دورات تعليمية في فصل الصيف لنشر رياضه السباحة و تعليم الأطفال و الشباب هذه المهارةالمهمة . `,
  },
  {
    id: 5,
    title: 'التنمية المجتمعية',
    description: 'مبادرات لخدمة المجتمع وتطوير الرياضة',
    icon: '🤝',
    img: '',
    color: '',
    backgroundImage: 'https://lyc.ly/assets/imeges/typs4.jpg',
    fullDescription: `
التنمية المجتمعية تهدف إلى تعزيز العلاقة بين النادي والمجتمع المحلي من خلال مجموعة متنوعة من الأنشطة والبرامج. إليك بعض الأفكار التي يمكن أن تُسهم في تحقيق التنمية المجتمعية لنادٍ بحري:`,

    text1: `
- *ورش عمل للسباحة والإبحار*: تنظيم ورش عمل تعليمية للأطفال والشباب لتعزيز مهاراتهم في السباحة والإبحار.
- *دورات إنقاذ ومساعدة*: تقديم دورات تدريبية على الإسعافات الأولية والإنقاذ البحري لأعضاء النادي وسكان المجتمع.
`,
    label1: '### 1. *البرامج التعليمية والتدريبية*:',

    label2: '  2. *الفعاليات الاجتماعية*: ',
    text2: `- *مهرجانات بحرية*: تنظيم مهرجانات أو أيام مفتوحة تدعو فيها المجتمع للمشاركة في الأنشطة البحرية والترفيهية.
- *مسابقات رياضية*: إقامة مسابقات تجديف، إبحار، وصيد سمك لجذب المجتمع وتشجيع الروح الرياضية.
`,
    label3: `### 3. *الاستدامة البيئية*:
`,
    text3: `- *حملات تنظيف الشواطئ*: تنظيم حملات دورية لتنظيف الشواطئ والمناطق البحرية القريبة من النادي.
- *توعية بيئية*: تقديم محاضرات وورش عمل حول الحفاظ على البيئة البحرية وأهمية التنوع البيولوجي.
`,
    label4: `### 4. *الشراكات المجتمعية*:
`,
    text4: `- *التعاون مع المدارس*: إنشاء شراكات مع المدارس المحلية لتقديم برامج تدريبية وزيارات ميدانية للنادي.
- *العمل مع المنظمات غير الربحية*: التعاون مع منظمات البيئة والمحافظة على الطبيعة لتعزيز الجهود المشتركة في حماية البيئة البحرية.

`,
    label5: `### 5. *خدمات للمجتمع*:
`,
    text5: `- *مرافق مجتمعية*: توفير مرافق للنادي يمكن أن تستخدم في الأحداث الاجتماعية والمناسبات الخاصة بالمجتمع.
- *برامج تطوعية*: تشجيع الأعضاء على المشاركة في الأنشطة التطوعية لخدمة المجتمع المحلي.
`,
    text6: `
التنمية المجتمعية لنادٍ بحري يمكن أن تجعل النادي جزءًا حيويًا من المجتمع، مما يساهم في تعزيز الوعي البيئي وتطوير مهارات الأفراد وتحقيق التفاعل الاجتماعي الإيجابي.`,
  },
]
